import{d as t,p as s,c as a,a as o,u as n,o as c}from"./index-C-wom_W7.js";const d=`
[玉桃文飨轩🍑](https://share.lovejade.cn/?utm_source=about)，专业的文本转图片工具。一键将 [Markdown](https://site.lovejade.cn/tags/Markdown) 转换为精美图片，支持书摘模式、自定义主题、字体和背景。所有数据本地处理保障隐私安全，完美适配多端展示。让文章分享、读书笔记、社交传播更有格调。项目基于 [Vue3](https://site.lovejade.cn/post/5b1a221c0526c920d6dfaada) 、 [Vite](https://site.lovejade.cn/post/6010e1b10c71de1fb957b64e) 、 [Pinia](https://site.lovejade.cn/post/631813c3c0922e0e572bde81) 、 [TailwindCSS](https://site.lovejade.cn/post/5fd20cb4c06d6302c1907ec7) 、 [TypeScript](https://site.lovejade.cn/post/6278fdeaac00ce3f9b11a8ef) 等技术栈构建，并在 [Github 开源](https://github.com/nicejade/markdown2png)。

![玉桃文飨轩 | 应用桌面端截图](https://share.lovejade.cn/screenshots/desktop.png)

## 诞生初衷

有搭建蛮多社区，诸如基于 \`Flarum\` 所搭建 [悠然宜想亭](https://forum.lovejade.cn/) ，虽然挺好用，但对于表格等 Markdown 语法，使用 Markdown 并不能得到预期解析；这就需要将内容转成图片，有尝试些工具，效果并不是很理想；于是最佳办法就是自己写一个。那时  Vue3、Vite、Pinia、TailwindCSS、TypeScript 等技术栈较火，也想着切实体验下。于是乎，便有了这个项目。

## 核心功能

- ✨ 一键将文本内容转换为高清图片，支持 Markdown 语法渲染；
- 📅 支持添加日期水印，让分享内容更专业、更有时效性；
- 🔒 所有数据本地处理，无需上传服务器，确保内容安全与隐私；
- 🎨 内置多款精美主题与字体，支持自由切换，让内容展示更有格调；
- 📱 灵活调整输出尺寸，完美适配手机、平板、电脑等多种设备；
- 💫 支持自定义背景、字体、颜色等，打造专属于您的分享样式；
- 📚 特色功能：[真实感书摘模式](https://share.lovejade.cn/digest)，让读书笔记分享更有质感；
- ⚡️ 一键复制图片至剪切板或下载图片，即时分享到各大社交平台；

> 无论是创作者分享文章、读者记录书摘，还是设计师输出文案，[玉桃文飨轩](https://share.lovejade.cn/)都能帮您轻松将文字转化为精美图片。

## 适用场景

您有一段文本（富文本或 **Markdown** ），如果想快速将其转换成图片，以便在社交平台、朋友圈、博客、或者 PPT 文稿分享，那么 [玉桃文飨轩](https://share.lovejade.cn/?utm_source=about) 可为您提供帮助。

## 命名来源

早在 [关于“悠然宜想亭”的由来，以及未来](https://forum.lovejade.cn/d/1) 一文提及，对于网站取名多是五个字；或是兴趣的原因，其后缀带有 [亭台楼阁、轩榭廊舫，殿庭苑斋](https://forum.lovejade.cn/d/9) 其中一个；其中大部分已被使用，只好使用最喜欢的这个「轩」字。那时，佳人仍在，与之相处，一日三见「桃🍑」；独“桃”难以成词，择「玉」字以配之；至于「文飨」（飨与“享”通假），寄托这款工具可作为「分享文字」之用。时隔年余，更多功能竟未完善，一如那逝去的爱恋，惜哉，如此而已。

## 相关链接

- [清风明月轩](https://www.thebettersites.com/)
- [逍遥自在轩](https://www.niceshare.site/)
- [晚晴幽草轩](https://www.jeffjade.com/nicelinks)
- [缘知随心庭](https://fine.niceshare.site/)
- [静轩之别苑](https://quickapp.lovejade.cn/)
- [悠然宜想亭](https://forum.lovejade.cn/)
- [SegmentFault](https://segmentfault.com/u/jeffjade)
- [X（Twitter）](https://x.com/MarshalXuan)

2023 年 11 月 27 日补录于〔深圳福田〕`,p={id:"about",class:"my-4 w-full max-w-xl"},r=["innerHTML"],m=t({__name:"About",setup(i){let e=s(d,{breaks:!0});return(h,l)=>(c(),a("div",p,[o("div",{class:"markdown",innerHTML:n(e)},null,8,r)]))}});export{m as default};
