import{d as s,p as n,c,a,u as i,o}from"./index-CbwOw4AX.js";const e=`
[玉桃文飨轩🍑](https://share.lovejade.cn/?utm_source=about) ，简单好用的在线文本工具；支持将 Markdown、Rich Text 等格式内容，快速转化为 png、pdf、html 等文件，并支持自定义设置、一键下载等功能。基于 [Vue3](https://nicelinks.site/post/5b1a221c0526c920d6dfaada) 、 [Vite](https://nicelinks.site/post/6010e1b10c71de1fb957b64e) 、 [Pinia](https://nicelinks.site/post/631813c3c0922e0e572bde81) 、 [TailwindCSS](https://nicelinks.site/post/5fd20cb4c06d6302c1907ec7) 、 [TypeScript](https://nicelinks.site/post/6278fdeaac00ce3f9b11a8ef) 构建。

## 诞生初衷

有搭建蛮多社区，诸如基于 [Flarum](https://nicelinks.site/post/604795465f9af714fe21dcbc) 所搭建 [悠然宜想亭](https://forum.lovejade.cn/) ，虽然挺好用，但对于表格等 Markdown 语法，使用 Markdown 并不能得到预期解析；这就需要将内容转成图片，有尝试些工具，效果并不是很理想；于是最佳办法就是自己写一个。那时 [Vue3](https://nicelinks.site/post/5b1a221c0526c920d6dfaada) 、 [Vite](https://nicelinks.site/post/6010e1b10c71de1fb957b64e) 、 [Pinia](https://nicelinks.site/post/631813c3c0922e0e572bde81) 、 [TailwindCSS](https://nicelinks.site/post/5fd20cb4c06d6302c1907ec7) 等技术栈较火，也想着切实体验下。于是乎，便有了这个项目。

## 核心功能

- 支持将文本内容转换 \`png\`；
- 支持为产物添加 \`日期\`；
- 数据本地保存，保证隐私安全；
- 支持一键 \`下载\` 转化后产物；
- 内置多种主题，支持切换；
- 自由选择适配各种设备的尺寸；

## 适用场景

假如您有一段文本（富文本或 [Markdown](https://nicelinks.site/tags/Markdown) ），想快速将其转换成图片，以便在社交平台、博文平台、PPT 文稿分享，那么 [玉桃文飨轩🍑](https://share.lovejade.cn/?utm_source=about) 可为您提供帮助。

## 命名来源

早在 [关于“悠然宜想亭”的由来，以及未来](https://forum.lovejade.cn/d/1) 一文提及，对于网站取名多是五个字；或是兴趣的原因，其后缀带有 [亭台楼阁、轩榭廊舫，殿庭苑斋](https://forum.lovejade.cn/d/9) 其中一个；其中大部分已被使用，只好使用最喜欢的这个「轩」字。那时，佳人仍在，与之相处，一日三见「桃🍑」；独“桃”难以成词，择「玉」字以配之；至于「文飨」（飨与“享”通假），寄托这款工具可作为「分享文字」之用。时隔年余，更多功能竟未完善，一如那逝去的爱恋，惜哉，如此而已。

2023 年 11 月 27 日补录于〔深圳福田〕`,d={id:"about",class:"w-full max-w-xl my-4"},p=["innerHTML"],f=s({__name:"About",setup(l){console.log(e);let t=n(e,{breaks:!0});return(r,u)=>(o(),c("div",d,[a("div",{class:"markdown",innerHTML:i(t)},null,8,p)]))}});export{f as default};
